#include <iostream>
#include <vector>
#include <string>
#include "../Vet/Vet.h";
#include "../Service/Service.h";

int main()
{
    vector<Vet> fill{};
    vector<Service> vector {
        Service(11,"Хирургия","Кастрация","искусственное прекращение функции половых желез",322,3500,fill),
        Service(12,"Хирургия","Стерилизация","удаление половых органов",169,3900,fill),
        Service(13,"Хирургия","Обработка ран","Обработка ран от инфекций",121,1000,fill),
        Service(14,"Хирургия","Эндоскопия","осмотр полостей тела животного длинной тонкой трубкой",267,500,fill),
        Service(21,"Поликлиника","Вакцинация","профилактика инфекционных заболеваний",512,2000,fill),
        Service(22,"Поликлиника","Чипирование","внедрение под кожу животного специального электронного чипа",67,1200,fill),
        Service(23,"Поликлиника","Рентген","исследование организма животного рентгеновскими лучами",243,2700,fill),
        Service(24,"Поликлиника","УЗИ","исследование организма животного ультразвуковыми волнами",475,750,fill),
        Service(31,"Косметика","Груминг","комплекс процедур для ухода за шерстью",597,4400,fill),
        Service(32,"Косметика","Стрижка","тримминг волосяных покровов",678,1800,fill),
        Service(33,"Косметика","Чистка ушей","прочистка ушных каналов",516,300,fill),
        Service(34,"Косметика","Стрижка когтей","процедура усечения когтей",756,600,fill),
    };

    for(int i = 0; i < vector.size(); i++)
    {
        vector[i].printService();
    }
     
    return 0;
}