#include <iostream>
#include <vector>
#include <string>
#include "../Vet/Vet.h";
#include "../Service/Service.h";

int main()
{
    vector<Vet> Surgeons{
        Vet("Хабибулина Э.Н.", "Хабибулина Эльвира Никитична", "Хирург", 25, 2000),
        Vet("Киселёв А.Ф.", "Киселёв Александр Фёдорович", "Хирург", 19, 1300),
    };

    vector<Vet> Policninicals{
        Vet("Романенко П.Е.", "Романенко Павел Егорович", "Терапевт", 36, 3100),
        Vet("Самойлов С.А.", "Самойлов Сергей Арсеньевич", "Терапевт", 6, 500),
    };

    vector<Vet> Cosmetics{
        Vet("Харитонов И.Е.", "Харитонов Иван Егорович", "Косметолог", 12, 1100),
        Vet("Абрамян А.С.", "Абрамян Аршавир Саркисович", "Косметолог", 1, 150),
    };

    vector<Service> vector {
        Service(11,"Хирургия","Кастрация","искусственное прекращение функции половых желез",322,3500,Surgeons),
        Service(12,"Хирургия","Стерилизация","удаление половых органов",169,3900,Surgeons),
        Service(13,"Хирургия","Обработка ран","Обработка ран от инфекций",121,1000,Surgeons),
        Service(14,"Хирургия","Эндоскопия","осмотр полостей тела животного длинной тонкой трубкой",267,500,Policninicals),
        Service(21,"Поликлиника","Вакцинация","профилактика инфекционных заболеваний",512,2000,Policninicals),
        Service(22,"Поликлиника","Чипирование","внедрение под кожу животного специального электронного чипа",67,1200,Policninicals),
        Service(23,"Поликлиника","Рентген","исследование организма животного рентгеновскими лучами",243,2700,Policninicals),
        Service(24,"Поликлиника","УЗИ","исследование организма животного ультразвуковыми волнами",475,750,Policninicals),
        Service(31,"Косметика","Груминг","комплекс процедур для ухода за шерстью",597,4400,Cosmetics),
        Service(32,"Косметика","Стрижка","тримминг волосяных покровов",678,1800,Cosmetics),
        Service(33,"Косметика","Чистка ушей","прочистка ушных каналов",516,300,Cosmetics),
        Service(34,"Косметика","Стрижка когтей","процедура усечения когтей",756,600,Cosmetics),
    };

    for(int i = 0; i < vector.size(); i++)
    {
        vector[i].printService();
    }
     
    return 0;
}